fio-test/results/write_out_conv_2/32k-libaio-1.out
job1: (g=0): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=11126: Tue Jun 25 23:25:23 2024
  write: IOPS=35.6k, BW=1114MiB/s (1168MB/s)(673GiB/618896msec); 0 zone resets
    slat (nsec): min=1732, max=382685, avg=7944.63, stdev=5384.88
    clat (usec): min=9, max=2904, avg=213.19, stdev=58.00
     lat (usec): min=55, max=2911, avg=221.30, stdev=59.61
    clat percentiles (usec):
     |  1.00th=[  151],  5.00th=[  161], 10.00th=[  165], 20.00th=[  172],
     | 30.00th=[  176], 40.00th=[  182], 50.00th=[  190], 60.00th=[  208],
     | 70.00th=[  245], 80.00th=[  258], 90.00th=[  273], 95.00th=[  297],
     | 99.00th=[  424], 99.50th=[  562], 99.90th=[  603], 99.95th=[  619],
     | 99.99th=[  701]
   bw (  MiB/s): min=  744, max= 1928, per=100.00%, avg=1118.93, stdev=22.53, samples=9853
   iops        : min=23836, max=61704, avg=35805.41, stdev=721.12, samples=9853
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.08%, 250=73.99%
  lat (usec)   : 500=25.25%, 750=0.67%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=3.02%, sys=4.76%, ctx=22057094, majf=0, minf=207
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,22056960,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1114MiB/s (1168MB/s), 1114MiB/s-1114MiB/s (1168MB/s-1168MB/s), io=673GiB (723GB), run=618896-618896msec

Disk stats (read/write):
    dm-0: ios=48/22056580, merge=0/0, ticks=4/4587880, in_queue=4587884, util=100.00%, aggrios=11/4411378, aggrmerge=0/0, aggrticks=0/138821, aggrin_queue=138821, aggrutil=100.00%
  nvme0n1: ios=0/3859941, merge=0/0, ticks=0/121066, in_queue=121066, util=99.96%
  nvme3n1: ios=0/3859941, merge=0/0, ticks=0/123996, in_queue=123995, util=99.98%
  nvme1n2: ios=26/4962816, merge=0/0, ticks=2/156666, in_queue=156667, util=100.00%
  nvme4n2: ios=12/4962816, merge=0/0, ticks=1/151103, in_queue=151104, util=100.00%
  nvme2n1: ios=0/3859941, merge=0/0, ticks=0/124029, in_queue=124029, util=99.99%
  nvme0n2: ios=36/4962816, merge=0/0, ticks=2/151450, in_queue=151452, util=100.00%
  nvme3n2: ios=18/4962816, merge=0/0, ticks=2/155315, in_queue=155318, util=100.00%
  nvme1n1: ios=0/3859941, merge=0/0, ticks=0/124189, in_queue=124190, util=99.96%
  nvme4n1: ios=0/3859941, merge=0/0, ticks=0/123799, in_queue=123798, util=99.99%
  nvme2n2: ios=20/4962816, merge=0/0, ticks=2/156597, in_queue=156599, util=100.00%